cozycactus/llvm-project/llvm/lib/Target/AVR32/AVR32Peephole.cpp
//===-- AVR32Peephole.cpp - AVR32 machine peephole optimizations ----------===//
//
// Part of the LLVM Project, under the Apache License v2.0 with LLVM Exceptions.
// See https://llvm.org/LICENSE.txt for license information.
// SPDX-License-Identifier: Apache-2.0 WITH LLVM-exception
//
//===----------------------------------------------------------------------===//

#include "AVR32.h"
#include "AVR32InstrInfo.h"
#include "AVR32Subtarget.h"
#include "llvm/ADT/DenseMap.h"
#include "llvm/ADT/STLExtras.h"
#include "llvm/ADT/SmallVector.h"
#include "llvm/ADT/StringRef.h"
#include "llvm/ADT/Statistic.h"
#include "llvm/CodeGen/MachineFunctionPass.h"
#include "llvm/CodeGen/MachineInstrBuilder.h"
#include "llvm/CodeGen/MachineRegisterInfo.h"
#include "llvm/CodeGen/LivePhysRegs.h"
#include "llvm/CodeGen/TargetInstrInfo.h"
#include "llvm/CodeGen/TargetRegisterInfo.h"
#include "llvm/Support/MathExtras.h"

using namespace llvm;

#define DEBUG_TYPE "avr32-peephole"

#define GET_INSTRINFO_ENUM
#include "AVR32GenInstrInfo.inc"
#define GET_REGINFO_ENUM
#include "AVR32GenRegisterInfo.inc"

STATISTIC(NumCompactForms, "Number of compact instruction forms selected");
STATISTIC(NumPredicatedStores, "Number of predicated stores selected");
STATISTIC(NumDoublewordMemOps, "Number of doubleword memory ops selected");

namespace {

class AVR32Peephole : public MachineFunctionPass {
public:
  static char ID;

  AVR32Peephole() : MachineFunctionPass(ID) {}

  StringRef getPassName() const override {
    return "AVR32 machine peephole optimizations";
  }

  bool runOnMachineFunction(MachineFunction &MF) override;

private:
  bool foldTwoAddressALU(MachineInstr &MI, unsigned CompactOpc,
                         bool Commutable, const TargetInstrInfo &TII);
  bool foldSignedImmediate(MachineInstr &MI, unsigned CompactOpc,
                           unsigned Bits, bool HasDef,
                           const TargetInstrInfo &TII);
  bool foldLoadDisp(MachineInstr &MI, unsigned CompactOpc, unsigned MaxDisp,
                    unsigned Align, const TargetInstrInfo &TII);
  bool foldStoreDisp(MachineInstr &MI, unsigned CompactOpc, unsigned MaxDisp,
                     unsigned Align, const TargetInstrInfo &TII);
  bool foldSPLoadDisp(MachineInstr &MI, const TargetInstrInfo &TII);
  bool foldSPStoreDisp(MachineInstr &MI, const TargetInstrInfo &TII);
  bool foldDoublewordLoad(MachineInstr &MI, const TargetInstrInfo &TII);
  bool foldDoublewordStore(MachineInstr &MI, const TargetInstrInfo &TII);
  bool foldMovhOr(MachineInstr &MI, const TargetInstrInfo &TII);
  bool foldBitImmediate(MachineInstr &MI, const TargetInstrInfo &TII);
  bool foldCompareImmediate(MachineInstr &MI, const TargetInstrInfo &TII);
  bool foldDoubleCompareLibcall(MachineInstr &MI, const TargetInstrInfo &TII);
  bool foldShiftedMaskIndexLoad(MachineInstr &MI, const TargetInstrInfo &TII,
                                const TargetRegisterInfo &TRI);
  bool foldRotate16(MachineInstr &MI, const TargetInstrInfo &TII);
  bool foldNarrowCompare(MachineInstr &MI, const TargetInstrInfo &TII,
                         const TargetRegisterInfo &TRI);
  bool foldRedundantCastBeforeCompare(MachineInstr &MI,
                                      const TargetRegisterInfo &TRI);
  bool repairDivRemainderClobbers(MachineFunction &MF,
                                  const TargetInstrInfo &TII,
                                  const TargetRegisterInfo &TRI);
  bool repairCompareBranchFlagClobbers(MachineFunction &MF,
                                       const TargetRegisterInfo &TRI);
  bool foldNearBranches(MachineFunction &MF, const TargetInstrInfo &TII);
  bool foldPredicatedStores(MachineFunction &MF, const TargetInstrInfo &TII);
};

} // end anonymous namespace

char AVR32Peephole::ID = 0;

INITIALIZE_PASS(AVR32Peephole, DEBUG_TYPE, "AVR32 Peephole Optimizations",
                false, false)

static bool isRegOperand(const MachineOperand &MO) {
  return MO.isReg() && MO.getReg().isValid() && !MO.getReg().isVirtual();
}

static bool isSignedNBit(int64_t Value, unsigned Bits) {
  int64_t Min = -(int64_t(1) << (Bits - 1));
  int64_t Max = (int64_t(1) << (Bits - 1)) - 1;
  return Value >= Min && Value <= Max;
}

static bool isCompactDisp(int64_t Value, unsigned MaxDisp, unsigned Align) {
  return Value >= 0 && static_cast<uint64_t>(Value) <= MaxDisp &&
         Value % Align == 0;
}

static bool isMovLowImmOpcode(unsigned Opcode) {
  return Opcode == AVR32::MOVri8 || Opcode == AVR32::MOVri21;
}

static bool isMoveImmToReg(const MachineInstr &MI, Register Reg,
                           int64_t Imm) {
  return isMovLowImmOpcode(MI.getOpcode()) && MI.getNumOperands() >= 2 &&
         isRegOperand(MI.getOperand(0)) && MI.getOperand(0).getReg() == Reg &&
         MI.getOperand(1).isImm() && MI.getOperand(1).getImm() == Imm;
}

static MachineBasicBlock::iterator
prevNonDebug(MachineBasicBlock::iterator I) {
  MachineBasicBlock &MBB = *I->getParent();
  while (I != MBB.begin()) {
    --I;
    if (!I->isDebugInstr())
      return I;
  }
  return MBB.end();
}

static Register getDoublewordHighReg(Register Low) {
  switch (Low) {
  case AVR32::R0:
    return AVR32::R1;
  case AVR32::R2:
    return AVR32::R3;
  case AVR32::R4:
    return AVR32::R5;
  case AVR32::R6:
    return AVR32::R7;
  case AVR32::R8:
    return AVR32::R9;
  case AVR32::R10:
    return AVR32::R11;
  default:
    return Register();
  }
}

static bool hasOrderedMemOperand(const MachineInstr &MI) {
  return llvm::any_of(MI.memoperands(), [](const MachineMemOperand *MMO) {
    return MMO->isVolatile() || MMO->isAtomic();
  });
}

static bool isDoublewordFoldableLoadOpcode(unsigned Opcode) {
  return Opcode == AVR32::LD_W_Disp16 || Opcode == AVR32::LD_W_Disp5 ||
         Opcode == AVR32::LDDSP;
}

static bool isDoublewordFoldableStoreOpcode(unsigned Opcode) {
  return Opcode == AVR32::ST_W_Disp16 || Opcode == AVR32::ST_W_Disp4 ||
         Opcode == AVR32::STDSP;
}

static bool hasSameBaseAndDisp(const MachineInstr &LowAddrMI,
                               const MachineInstr &HighAddrMI, bool IsStore) {
  unsigned BaseIdx = IsStore ? 0 : 1;
  unsigned DispIdx = IsStore ? 1 : 2;
  if (!isRegOperand(LowAddrMI.getOperand(BaseIdx)) ||
      !isRegOperand(HighAddrMI.getOperand(BaseIdx)) ||
      LowAddrMI.getOperand(BaseIdx).getReg() !=
          HighAddrMI.getOperand(BaseIdx).getReg() ||
      !LowAddrMI.getOperand(DispIdx).isImm() ||
      !HighAddrMI.getOperand(DispIdx).isImm())
    return false;

  int64_t LowAddrDisp = LowAddrMI.getOperand(DispIdx).getImm();
  int64_t HighAddrDisp = HighAddrMI.getOperand(DispIdx).getImm();
  return isInt<16>(LowAddrDisp) && HighAddrDisp == LowAddrDisp + 4;
}

static StringRef getDirectCallTargetName(const MachineInstr &MI) {
  if ((MI.getOpcode() != AVR32::RCALLeCG &&
       MI.getOpcode() != AVR32::CALLp) ||
      MI.getNumOperands() == 0)
    return StringRef();

  const MachineOperand &Target = MI.getOperand(0);
  if (Target.isSymbol())
    return Target.getSymbolName();
  if (Target.isGlobal())
    return Target.getGlobal()->getName();
  return StringRef();
}

static bool retargetDirectCall(MachineInstr &MI, StringRef From,
                               const char *To) {
  if (getDirectCallTargetName(MI) != From)
    return false;

  MachineOperand &Target = MI.getOperand(0);
  Target.ChangeToES(To, Target.getTargetFlags());
  return true;
}

static void insertF64ArgSwapBefore(MachineInstr &Call,
                                   const TargetInstrInfo &TII) {
  MachineBasicBlock &MBB = *Call.getParent();
  const DebugLoc &DL = Call.getDebugLoc();
  BuildMI(MBB, Call, DL, TII.get(AVR32::MOVrr), AVR32::R12).addReg(AVR32::R9);
  BuildMI(MBB, Call, DL, TII.get(AVR32::MOVrr), AVR32::LR).addReg(AVR32::R8);
  BuildMI(MBB, Call, DL, TII.get(AVR32::MOVrr), AVR32::R9).addReg(AVR32::R11);
  BuildMI(MBB, Call, DL, TII.get(AVR32::MOVrr), AVR32::R8).addReg(AVR32::R10);
  BuildMI(MBB, Call, DL, TII.get(AVR32::MOVrr), AVR32::R11)
      .addReg(AVR32::R12);
  BuildMI(MBB, Call, DL, TII.get(AVR32::MOVrr), AVR32::R10).addReg(AVR32::LR);
}

static bool isCompareOpcode(unsigned Opcode) {
  switch (Opcode) {
  case AVR32::CPrr:
  case AVR32::CP_Wrr:
  case AVR32::CPri6:
  case AVR32::CPri21:
  case AVR32::CP_Wri6:
  case AVR32::CP_Wri21:
  case AVR32::CP_Brr:
  case AVR32::CP_Hrr:
    return true;
  default:
    return false;
  }
}

static bool compareUsesReg(const MachineInstr &MI, Register Reg) {
  if (!isCompareOpcode(MI.getOpcode()))
    return false;
  for (const MachineOperand &MO : MI.operands())
    if (MO.isReg() && MO.isUse() && MO.getReg() == Reg)
      return true;
  return false;
}

static std::optional<unsigned> getCompareImmOpcode(unsigned Opcode) {
  switch (Opcode) {
  case AVR32::CPrr:
    return AVR32::CPri21;
  case AVR32::CP_Wrr:
    return AVR32::CP_Wri21;
  default:
    return std::nullopt;
  }
}

static bool isImmediateCompareOpcode(unsigned Opcode) {
  switch (Opcode) {
  case AVR32::CPri6:
  case AVR32::CPri21:
  case AVR32::CP_Wri6:
  case AVR32::CP_Wri21:
    return true;
  default:
    return false;
  }
}

static bool explicitlyDefinesReg(const MachineInstr &MI, Register Reg) {
  for (const MachineOperand &MO : MI.operands())
    if (MO.isReg() && MO.isDef() && MO.getReg() == Reg)
      return true;
  return false;
}

static bool hasLiveSRegDef(const MachineInstr &MI) {
  for (const MachineOperand &MO : MI.operands())
    if (MO.isReg() && MO.isDef() && MO.getReg() == AVR32::SREG &&
        !MO.isDead())
      return true;
  return false;
}

static bool isQuotientOnlyDivOpcode(unsigned Opcode) {
  return Opcode == AVR32::DIVSrrrQ || Opcode == AVR32::DIVUrrrQ;
}

static Register getDivRemainderReg(Register QuotReg) {
  switch (QuotReg.id()) {
  case AVR32::R0:
    return AVR32::R1;
  case AVR32::R2:
    return AVR32::R3;
  case AVR32::R4:
    return AVR32::R5;
  case AVR32::R6:
    return AVR32::R7;
  case AVR32::R8:
    return AVR32::R9;
  case AVR32::R10:
    return AVR32::R11;
  default:
    return Register();
  }
}

static std::optional<Register>
findAvailableDivQuotReg(const LivePhysRegs &Live,
                        const MachineRegisterInfo &MRI) {
  static const MCPhysReg Candidates[] = {AVR32::R8, AVR32::R10, AVR32::R4,
                                         AVR32::R6, AVR32::R0, AVR32::R2};
  for (MCPhysReg Low : Candidates) {
    Register High = getDivRemainderReg(Low);
    if (High && Live.available(MRI, Low) && Live.available(MRI, High))
      return Low;
  }
  return std::nullopt;
}

