cozycactus/llvm-project/llvm/lib/Target/AVR32/AVR32Peephole.cpp
static bool isEqualityConditionOpcode(unsigned Opcode) {
  return Opcode == AVR32::BREQbb || Opcode == AVR32::BRNEbb ||
         Opcode == AVR32::MOVEQriCG || Opcode == AVR32::MOVNEriCG ||
         Opcode == AVR32::MOVEQrrCG || Opcode == AVR32::MOVNErrCG;
}

static bool isUnsignedConditionOpcode(unsigned Opcode) {
  switch (Opcode) {
  case AVR32::BRCCbb:
  case AVR32::BRCSbb:
  case AVR32::BRLSbb:
  case AVR32::BRHIbb:
  case AVR32::MOVCCriCG:
  case AVR32::MOVCSriCG:
  case AVR32::MOVLSriCG:
  case AVR32::MOVHIriCG:
  case AVR32::MOVCCrrCG:
  case AVR32::MOVCSrrCG:
  case AVR32::MOVLSrrCG:
  case AVR32::MOVHIrrCG:
    return true;
  default:
    return false;
  }
}

static bool isSignedConditionOpcode(unsigned Opcode) {
  switch (Opcode) {
  case AVR32::BRGEbb:
  case AVR32::BRLTbb:
  case AVR32::BRGTbb:
  case AVR32::BRLEbb:
  case AVR32::MOVGEriCG:
  case AVR32::MOVLTriCG:
  case AVR32::MOVGTriCG:
  case AVR32::MOVLEriCG:
  case AVR32::MOVGErrCG:
  case AVR32::MOVLTrrCG:
  case AVR32::MOVGTrrCG:
  case AVR32::MOVLErrCG:
    return true;
  default:
    return false;
  }
}

static bool hasCompatibleNarrowCompareUser(const MachineInstr &MI,
                                           bool Signed) {
  MachineBasicBlock::const_iterator NextIt = std::next(MI.getIterator());
  const MachineBasicBlock &MBB = *MI.getParent();
  while (NextIt != MBB.end() && NextIt->isDebugInstr())
    ++NextIt;
  if (NextIt == MBB.end())
    return false;

  unsigned Opcode = NextIt->getOpcode();
  if (isEqualityConditionOpcode(Opcode))
    return true;
  return Signed ? isSignedConditionOpcode(Opcode)
                : isUnsignedConditionOpcode(Opcode);
}

static bool isLowMaterializationOperand(const MachineOperand &MO) {
  if (MO.isImm())
    return true;
  return (MO.isGlobal() || MO.isSymbol()) &&
         MO.getTargetFlags() == AVR32II::MO_ABS_LO;
}

static bool isHighMaterializationOperand(const MachineOperand &MO) {
  if (MO.isImm())
    return true;
  return (MO.isGlobal() || MO.isSymbol()) &&
         MO.getTargetFlags() == AVR32II::MO_ABS_HI;
}

static bool isMatchingHiLoPair(const MachineOperand &Low,
                               const MachineOperand &High) {
  if (Low.isImm() && High.isImm())
    return true;
  if (Low.isImm() || High.isImm())
    return false;
  if (Low.getTargetFlags() != AVR32II::MO_ABS_LO ||
      High.getTargetFlags() != AVR32II::MO_ABS_HI ||
      Low.getOffset() != High.getOffset())
    return false;
  if (Low.isGlobal() && High.isGlobal())
    return Low.getGlobal() == High.getGlobal();
  if (Low.isSymbol() && High.isSymbol())
    return StringRef(Low.getSymbolName()) == High.getSymbolName();
  return false;
}

static bool isMovLowMaterialization(const MachineInstr &MI) {
  return isMovLowImmOpcode(MI.getOpcode()) && MI.getNumOperands() == 2 &&
         isRegOperand(MI.getOperand(0)) &&
         isLowMaterializationOperand(MI.getOperand(1));
}

static bool isMovhMaterialization(const MachineInstr &MI) {
  return MI.getOpcode() == AVR32::MOVHri && MI.getNumOperands() == 2 &&
         isRegOperand(MI.getOperand(0)) &&
         isHighMaterializationOperand(MI.getOperand(1));
}

static std::optional<unsigned> getSingleSetBit(uint32_t Value) {
  if (Value == 0 || (Value & (Value - 1)) != 0)
    return std::nullopt;
  return llvm::countr_zero(Value);
}

static std::optional<unsigned> getBitSetIndex(unsigned Opcode, int64_t Imm) {
  uint32_t Value = static_cast<uint32_t>(Imm);
  switch (Opcode) {
  case AVR32::ORrr:
    return getSingleSetBit(Value);
  case AVR32::ORLri:
  case AVR32::ORLcg:
    return getSingleSetBit(Value & 0xffff);
  case AVR32::ORHri:
  case AVR32::ORHcg:
    if (std::optional<unsigned> Bit = getSingleSetBit(Value & 0xffff))
      return *Bit + 16;
    return std::nullopt;
  default:
    return std::nullopt;
  }
}

static std::optional<unsigned> getBitClearIndex(unsigned Opcode, int64_t Imm) {
  uint32_t Value = static_cast<uint32_t>(Imm);
  switch (Opcode) {
  case AVR32::ANDrr:
    return getSingleSetBit(~Value);
  case AVR32::ANDLri:
  case AVR32::ANDLcg:
    return getSingleSetBit((~Value) & 0xffff);
  case AVR32::ANDHri:
  case AVR32::ANDHcg:
    if (std::optional<unsigned> Bit = getSingleSetBit((~Value) & 0xffff))
      return *Bit + 16;
    return std::nullopt;
  default:
    return std::nullopt;
  }
}

static std::optional<unsigned> getZeroExtendedWidth(const MachineInstr &MI) {
  switch (MI.getOpcode()) {
  case AVR32::LD_UB_Disp3:
  case AVR32::LD_UB_Disp16:
  case AVR32::LD_UB_IndexShift:
  case AVR32::LD_UB_PostInc:
  case AVR32::LD_UB_PreDec:
  case AVR32::CASTU_Bcg:
    return 8;
  case AVR32::LD_UH_Disp3:
  case AVR32::LD_UH_Disp16:
  case AVR32::LD_UH_IndexShift:
  case AVR32::LD_UH_PostInc:
  case AVR32::LD_UH_PreDec:
  case AVR32::CASTU_Hcg:
    return 16;
  default:
    return std::nullopt;
  }
}

static std::optional<unsigned> getSignExtendedWidth(const MachineInstr &MI) {
  switch (MI.getOpcode()) {
  case AVR32::LD_SB_Disp16:
  case AVR32::LD_SB_IndexShift:
  case AVR32::CASTS_Bcg:
    return 8;
  case AVR32::LD_SH_Disp3:
  case AVR32::LD_SH_Disp16:
  case AVR32::LD_SH_IndexShift:
  case AVR32::LD_SH_PostInc:
  case AVR32::LD_SH_PreDec:
  case AVR32::CASTS_Hcg:
    return 16;
  default:
    return std::nullopt;
  }
}

static bool isImmediateAlreadyExtended(int64_t Imm, bool Signed,
                                       unsigned Width) {
  if (Signed)
    return isSignedNBit(Imm, Width);
  return Imm >= 0 && static_cast<uint64_t>(Imm) < (uint64_t(1) << Width);
}

static bool isRegAlreadyExtendedBefore(MachineBasicBlock &MBB,
                                       MachineBasicBlock::iterator Pos,
                                       Register Reg, bool Signed,
                                       unsigned Width,
                                       const TargetRegisterInfo &TRI,
                                       unsigned Depth);

static bool isRegAlreadyExtendedBefore(MachineBasicBlock::iterator Pos,
                                       Register Reg, bool Signed,
                                       unsigned Width,
                                       const TargetRegisterInfo &TRI,
                                       unsigned Depth = 8) {
  return isRegAlreadyExtendedBefore(*Pos->getParent(), Pos, Reg, Signed, Width,
                                    TRI, Depth);
}

static bool isRegAlreadyExtendedBefore(MachineBasicBlock &MBB,
                                       MachineBasicBlock::iterator Pos,
                                       Register Reg, bool Signed,
                                       unsigned Width,
                                       const TargetRegisterInfo &TRI,
                                       unsigned Depth) {
  if (!Depth)
    return false;

  for (MachineBasicBlock::iterator I = Pos; I != MBB.begin();) {
    --I;
    MachineInstr &DefMI = *I;
    if (DefMI.isDebugInstr())
      continue;
    if (!DefMI.modifiesRegister(Reg, &TRI))
      continue;
    if (!explicitlyDefinesReg(DefMI, Reg))
      return false;

    if (DefMI.getOpcode() == AVR32::MOVrr && DefMI.getNumOperands() == 2 &&
        isRegOperand(DefMI.getOperand(0)) && isRegOperand(DefMI.getOperand(1)) &&
        DefMI.getOperand(0).getReg() == Reg)
      return isRegAlreadyExtendedBefore(I, DefMI.getOperand(1).getReg(),
                                        Signed, Width, TRI, Depth - 1);

    if (isMovLowImmOpcode(DefMI.getOpcode()) && DefMI.getNumOperands() == 2 &&
        isRegOperand(DefMI.getOperand(0)) && DefMI.getOperand(0).getReg() == Reg &&
        DefMI.getOperand(1).isImm())
      return isImmediateAlreadyExtended(DefMI.getOperand(1).getImm(), Signed,
                                        Width);

    std::optional<unsigned> KnownWidth =
        Signed ? getSignExtendedWidth(DefMI) : getZeroExtendedWidth(DefMI);
    if (KnownWidth && *KnownWidth <= Width)
      return true;

