cozycactus/llvm-project/llvm/lib/Target/AVR32/AVR32Peephole.cpp
    return false;
  }

  if (MBB.pred_size() != 1)
    return false;

  MachineBasicBlock *Pred = *MBB.pred_begin();
  if (Pred == &MBB)
    return false;

  return isRegAlreadyExtendedBefore(*Pred, Pred->end(), Reg, Signed, Width, TRI,
                                    Depth - 1);
}

static unsigned getInstSize(const MachineInstr &MI) {
  if (MI.isDebugInstr())
    return 0;
  return MI.getDesc().getSize();
}

static std::optional<unsigned> getCompactBranchOpcode(unsigned Opcode) {
  switch (Opcode) {
  case AVR32::BREQbb:
    return AVR32::BREQcbb;
  case AVR32::BRNEbb:
    return AVR32::BRNEcbb;
  case AVR32::BRCCbb:
    return AVR32::BRCCcbb;
  case AVR32::BRCSbb:
    return AVR32::BRCScbb;
  case AVR32::BRGEbb:
    return AVR32::BRGEcbb;
  case AVR32::BRLTbb:
    return AVR32::BRLTcbb;
  default:
    return std::nullopt;
  }
}

enum class AVR32Cond {
  EQ,
  NE,
  CC,
  CS,
  GE,
  LT,
  LS,
  GT,
  LE,
  HI,
};

static std::optional<AVR32Cond> getStoreConditionForSkippedBranch(
    unsigned Opcode) {
  switch (Opcode) {
  case AVR32::BREQbb:
  case AVR32::BREQcbb:
    return AVR32Cond::NE;
  case AVR32::BRNEbb:
  case AVR32::BRNEcbb:
    return AVR32Cond::EQ;
  case AVR32::BRCCbb:
  case AVR32::BRCCcbb:
    return AVR32Cond::CS;
  case AVR32::BRCSbb:
  case AVR32::BRCScbb:
    return AVR32Cond::CC;
  case AVR32::BRGEbb:
  case AVR32::BRGEcbb:
    return AVR32Cond::LT;
  case AVR32::BRLTbb:
  case AVR32::BRLTcbb:
    return AVR32Cond::GE;
  case AVR32::BRLSbb:
    return AVR32Cond::HI;
  case AVR32::BRGTbb:
    return AVR32Cond::LE;
  case AVR32::BRLEbb:
    return AVR32Cond::GT;
  case AVR32::BRHIbb:
    return AVR32Cond::LS;
  default:
    return std::nullopt;
  }
}

static bool fitsPredicatedStoreDisp(unsigned StoreOpcode, int64_t Disp) {
  switch (StoreOpcode) {
  case AVR32::ST_B_Disp3:
  case AVR32::ST_B_Disp16:
    return isCompactDisp(Disp, 511, 1);
  case AVR32::ST_H_Disp3:
  case AVR32::ST_H_Disp16:
    return isCompactDisp(Disp, 1022, 2);
  case AVR32::ST_W_Disp4:
  case AVR32::ST_W_Disp16:
    return isCompactDisp(Disp, 2044, 4);
  default:
    return false;
  }
}

static bool isConditionalBranchOpcode(unsigned Opcode) {
  return getStoreConditionForSkippedBranch(Opcode).has_value();
}

static bool isMovableAcrossCompare(const MachineInstr &MI,
                                   const TargetRegisterInfo &TRI) {
  if (MI.isDebugInstr())
    return true;
  if (MI.isTerminator() || MI.isBranch() || MI.isCall() || MI.isReturn() ||
      MI.isInlineAsm())
    return false;
  if (MI.mayLoad() || MI.mayStore() || MI.hasUnmodeledSideEffects())
    return false;
  return !MI.readsRegister(AVR32::SREG, &TRI);
}

static bool definesAnyCompareInput(const MachineInstr &MI,
                                   const MachineInstr &Cmp,
                                   const TargetRegisterInfo &TRI) {
  for (const MachineOperand &Def : MI.operands()) {
    if (!Def.isReg() || !Def.isDef() || !Def.getReg().isValid())
      continue;
    for (const MachineOperand &Use : Cmp.operands()) {
      if (!Use.isReg() || !Use.isUse() || !Use.getReg().isValid())
        continue;
      if (TRI.regsOverlap(Def.getReg(), Use.getReg()))
        return true;
    }
  }
  return false;
}

static std::optional<unsigned> getPredicatedStoreOpcode(unsigned StoreOpcode,
                                                        AVR32Cond Cond) {
  switch (StoreOpcode) {
  case AVR32::ST_B_Disp3:
  case AVR32::ST_B_Disp16:
    switch (Cond) {
    case AVR32Cond::EQ:
      return AVR32::ST_B_EQ_Disp9;
    case AVR32Cond::NE:
      return AVR32::ST_B_NE_Disp9;
    case AVR32Cond::CC:
      return AVR32::ST_B_CC_Disp9;
    case AVR32Cond::CS:
      return AVR32::ST_B_CS_Disp9;
    case AVR32Cond::GE:
      return AVR32::ST_B_GE_Disp9;
    case AVR32Cond::LT:
      return AVR32::ST_B_LT_Disp9;
    case AVR32Cond::LS:
      return AVR32::ST_B_LS_Disp9;
    case AVR32Cond::GT:
      return AVR32::ST_B_GT_Disp9;
    case AVR32Cond::LE:
      return AVR32::ST_B_LE_Disp9;
    case AVR32Cond::HI:
      return AVR32::ST_B_HI_Disp9;
    }
    llvm_unreachable("unknown AVR32 condition");
  case AVR32::ST_H_Disp3:
  case AVR32::ST_H_Disp16:
    switch (Cond) {
    case AVR32Cond::EQ:
      return AVR32::ST_H_EQ_Disp9;
    case AVR32Cond::NE:
      return AVR32::ST_H_NE_Disp9;
    case AVR32Cond::CC:
      return AVR32::ST_H_CC_Disp9;
    case AVR32Cond::CS:
      return AVR32::ST_H_CS_Disp9;
    case AVR32Cond::GE:
      return AVR32::ST_H_GE_Disp9;
    case AVR32Cond::LT:
      return AVR32::ST_H_LT_Disp9;
    case AVR32Cond::LS:
      return AVR32::ST_H_LS_Disp9;
    case AVR32Cond::GT:
      return AVR32::ST_H_GT_Disp9;
    case AVR32Cond::LE:
      return AVR32::ST_H_LE_Disp9;
    case AVR32Cond::HI:
      return AVR32::ST_H_HI_Disp9;
    }
    llvm_unreachable("unknown AVR32 condition");
  case AVR32::ST_W_Disp4:
  case AVR32::ST_W_Disp16:
    switch (Cond) {
    case AVR32Cond::EQ:
      return AVR32::ST_W_EQ_Disp9;
    case AVR32Cond::NE:
      return AVR32::ST_W_NE_Disp9;
    case AVR32Cond::CC:
      return AVR32::ST_W_CC_Disp9;
    case AVR32Cond::CS:
      return AVR32::ST_W_CS_Disp9;
    case AVR32Cond::GE:
      return AVR32::ST_W_GE_Disp9;
    case AVR32Cond::LT:
      return AVR32::ST_W_LT_Disp9;
    case AVR32Cond::LS:
      return AVR32::ST_W_LS_Disp9;
    case AVR32Cond::GT:
      return AVR32::ST_W_GT_Disp9;
    case AVR32Cond::LE:
      return AVR32::ST_W_LE_Disp9;
    case AVR32Cond::HI:
      return AVR32::ST_W_HI_Disp9;
    }
    llvm_unreachable("unknown AVR32 condition");
  default:
    return std::nullopt;
  }
}

bool AVR32Peephole::foldTwoAddressALU(MachineInstr &MI, unsigned CompactOpc,
                                      bool Commutable,
                                      const TargetInstrInfo &TII) {
  if (MI.getNumExplicitOperands() != 3)
    return false;

  const MachineOperand &Dst = MI.getOperand(0);
  const MachineOperand &LHS = MI.getOperand(1);
  const MachineOperand &RHS = MI.getOperand(2);
  if (!isRegOperand(Dst) || !isRegOperand(LHS) || !isRegOperand(RHS))
    return false;

  Register DstReg = Dst.getReg();
  unsigned SrcIdx = 0;
  unsigned OldIdx = 0;
  if (DstReg == LHS.getReg()) {
    OldIdx = 1;
    SrcIdx = 2;
  } else if (Commutable && DstReg == RHS.getReg()) {
    OldIdx = 2;
    SrcIdx = 1;
  } else {
    return false;
  }

  const MachineOperand &Old = MI.getOperand(OldIdx);
  const MachineOperand &Src = MI.getOperand(SrcIdx);
  MachineBasicBlock &MBB = *MI.getParent();
  MachineFunction &MF = *MBB.getParent();
  MachineInstrBuilder MIB =
      BuildMI(MBB, MI, MI.getDebugLoc(), TII.get(CompactOpc), DstReg)
          .addReg(DstReg, getKillRegState(Old.isKill()))
          .addReg(Src.getReg(), getKillRegState(Src.isKill()));
  MIB.setMIFlags(MI.getFlags());
  MIB->copyImplicitOps(MF, MI);
  MI.eraseFromParent();
  ++NumCompactForms;
  return true;
}

bool AVR32Peephole::foldMovhOr(MachineInstr &MI,
                               const TargetInstrInfo &TII) {
  if (MI.getIterator() == MI.getParent()->begin())
    return false;

  MachineBasicBlock::iterator HighIt = std::prev(MI.getIterator());
  if (HighIt == MI.getParent()->begin())
    return false;
  MachineBasicBlock::iterator LowIt = std::prev(HighIt);
  MachineInstr &LowMI = *LowIt;
  MachineInstr &HighMI = *HighIt;
  if (!isMovLowMaterialization(LowMI) || !isMovhMaterialization(HighMI) ||
      !isMatchingHiLoPair(LowMI.getOperand(1), HighMI.getOperand(1)))
    return false;

  Register DstReg;
  Register LowReg = LowMI.getOperand(0).getReg();
  Register HighReg = HighMI.getOperand(0).getReg();

