cozycactus/llvm-project/llvm/lib/Target/AVR32/AVR32Peephole.cpp
  if (MI.getOpcode() == AVR32::ORALrrr) {
    if (MI.getNumOperands() != 3 || !isRegOperand(MI.getOperand(0)) ||
        !isRegOperand(MI.getOperand(1)) || !isRegOperand(MI.getOperand(2)))
      return false;

    Register Src0 = MI.getOperand(1).getReg();
    Register Src1 = MI.getOperand(2).getReg();
    if (!((Src0 == HighReg && Src1 == LowReg) ||
          (Src0 == LowReg && Src1 == HighReg)))
      return false;
    DstReg = MI.getOperand(0).getReg();
  } else if (MI.getOpcode() == AVR32::ORrr) {
    if (MI.getNumOperands() != 2 || !isRegOperand(MI.getOperand(0)) ||
        !isRegOperand(MI.getOperand(1)))
      return false;

    DstReg = MI.getOperand(0).getReg();
    if (DstReg != LowReg || MI.getOperand(1).getReg() != HighReg)
      return false;
  } else {
    return false;
  }

  MachineBasicBlock &MBB = *MI.getParent();
  BuildMI(MBB, LowMI, LowMI.getDebugLoc(), TII.get(LowMI.getOpcode()), DstReg)
      .add(LowMI.getOperand(1))
      .setMIFlags(LowMI.getFlags());
  BuildMI(MBB, LowMI, HighMI.getDebugLoc(), TII.get(AVR32::ORHri), DstReg)
      .add(HighMI.getOperand(1))
      .setMIFlags(HighMI.getFlags());

  LowMI.eraseFromParent();
  HighMI.eraseFromParent();
  MI.eraseFromParent();
  ++NumCompactForms;
  return true;
}

bool AVR32Peephole::foldBitImmediate(MachineInstr &MI,
                                     const TargetInstrInfo &TII) {
  unsigned Opcode = MI.getOpcode();
  std::optional<unsigned> Bit;
  unsigned CompactOpc = 0;
  if (Opcode == AVR32::ORLri || Opcode == AVR32::ORHri ||
      Opcode == AVR32::ANDLri || Opcode == AVR32::ANDHri ||
      Opcode == AVR32::ORLcg || Opcode == AVR32::ORHcg ||
      Opcode == AVR32::ANDLcg || Opcode == AVR32::ANDHcg) {
    bool IsCodeGenOnly = MI.getNumOperands() == 3;
    if ((!IsCodeGenOnly && MI.getNumOperands() != 2) ||
        !isRegOperand(MI.getOperand(0)))
      return false;

    if (IsCodeGenOnly &&
        (!isRegOperand(MI.getOperand(1)) ||
         MI.getOperand(0).getReg() != MI.getOperand(1).getReg()))
      return false;

    const MachineOperand &ImmOp = MI.getOperand(IsCodeGenOnly ? 2 : 1);
    if (!ImmOp.isImm())
      return false;

    Bit = getBitSetIndex(Opcode, ImmOp.getImm());
    CompactOpc = AVR32::SBRri;
    if (!Bit) {
      Bit = getBitClearIndex(Opcode, ImmOp.getImm());
      CompactOpc = AVR32::CBRri;
    }
    if (!Bit)
      return false;

    MachineBasicBlock &MBB = *MI.getParent();
    BuildMI(MBB, MI, MI.getDebugLoc(), TII.get(CompactOpc))
        .addReg(MI.getOperand(0).getReg())
        .addImm(*Bit)
        .setMIFlags(MI.getFlags());
    MI.eraseFromParent();
    ++NumCompactForms;
    return true;
  }

  if (Opcode != AVR32::ORrr && Opcode != AVR32::ANDrr)
    return false;
  if (MI.getNumOperands() != 2 || !isRegOperand(MI.getOperand(0)) ||
      !isRegOperand(MI.getOperand(1)) || !MI.getOperand(1).isKill())
    return false;
  if (MI.getIterator() == MI.getParent()->begin())
    return false;

  MachineBasicBlock::iterator ImmIt = std::prev(MI.getIterator());
  MachineInstr &ImmMI = *ImmIt;
  if (!isMovLowImmOpcode(ImmMI.getOpcode()) || ImmMI.getNumOperands() != 2 ||
      !isRegOperand(ImmMI.getOperand(0)) || !ImmMI.getOperand(1).isImm())
    return false;

  Register DstReg = MI.getOperand(0).getReg();
  Register ImmReg = MI.getOperand(1).getReg();
  if (DstReg == ImmReg || ImmMI.getOperand(0).getReg() != ImmReg)
    return false;

  Bit = getBitSetIndex(Opcode, ImmMI.getOperand(1).getImm());
  CompactOpc = AVR32::SBRri;
  if (!Bit) {
    Bit = getBitClearIndex(Opcode, ImmMI.getOperand(1).getImm());
    CompactOpc = AVR32::CBRri;
  }
  if (!Bit)
    return false;

  MachineBasicBlock &MBB = *MI.getParent();
  BuildMI(MBB, ImmMI, MI.getDebugLoc(), TII.get(CompactOpc))
      .addReg(DstReg)
      .addImm(*Bit)
      .setMIFlags(MI.getFlags());
  ImmMI.eraseFromParent();
  MI.eraseFromParent();
  ++NumCompactForms;
  return true;
}

bool AVR32Peephole::foldCompareImmediate(MachineInstr &MI,
                                         const TargetInstrInfo &TII) {
  std::optional<unsigned> ImmOpc = getCompareImmOpcode(MI.getOpcode());
  if (!ImmOpc || MI.getNumOperands() != 2 || !isRegOperand(MI.getOperand(0)) ||
      !isRegOperand(MI.getOperand(1)) || !MI.getOperand(1).isKill())
    return false;
  if (MI.getIterator() == MI.getParent()->begin())
    return false;

  MachineBasicBlock::iterator ImmIt = std::prev(MI.getIterator());
  MachineInstr &ImmMI = *ImmIt;
  if (!isMovLowImmOpcode(ImmMI.getOpcode()) || ImmMI.getNumOperands() != 2 ||
      !isRegOperand(ImmMI.getOperand(0)) || !ImmMI.getOperand(1).isImm() ||
      ImmMI.getOperand(0).getReg() != MI.getOperand(1).getReg())
    return false;

  int64_t Imm = ImmMI.getOperand(1).getImm();
  if (!isSignedNBit(Imm, 21))
    return false;

  MachineBasicBlock &MBB = *MI.getParent();
  MachineFunction &MF = *MBB.getParent();
  MachineInstrBuilder MIB =
      BuildMI(MBB, ImmMI, MI.getDebugLoc(), TII.get(*ImmOpc))
          .addReg(MI.getOperand(0).getReg(),
                  getKillRegState(MI.getOperand(0).isKill()))
          .addImm(Imm);
  MIB.setMIFlags(MI.getFlags());
  MIB->copyImplicitOps(MF, MI);
  ImmMI.eraseFromParent();
  MI.eraseFromParent();
  ++NumCompactForms;
  return true;
}

bool AVR32Peephole::foldDoubleCompareLibcall(
    MachineInstr &MI, const TargetInstrInfo &TII) {
  if (MI.getOpcode() == AVR32::SREQr || MI.getOpcode() == AVR32::SRLTr) {
    if (MI.getNumOperands() < 1 || !isRegOperand(MI.getOperand(0)))
      return false;

    MachineBasicBlock &MBB = *MI.getParent();
    MachineBasicBlock::iterator Cmp = prevNonDebug(MI.getIterator());
    if (Cmp == MBB.end())
      return false;

    auto RetargetAndEraseCmp = [&](MachineBasicBlock::iterator Call,
                                   StringRef From, const char *To,
                                   bool SwapArgs) {
      if (Call == MBB.end() || !retargetDirectCall(*Call, From, To))
        return false;
      if (SwapArgs)
        insertF64ArgSwapBefore(*Call, TII);
      Cmp->eraseFromParent();
      MI.setDesc(TII.get(AVR32::SRNEr));
      ++NumCompactForms;
      return true;
    };

