cozycactus/llvm-project/llvm/lib/Target/AVR32/AVR32Peephole.cpp
    if (isImmediateCompareOpcode(Cmp->getOpcode()) &&
        Cmp->getNumOperands() >= 2 && isRegOperand(Cmp->getOperand(0)) &&
        Cmp->getOperand(0).getReg() == AVR32::R12 &&
        Cmp->getOperand(1).isImm()) {
      int64_t Imm = Cmp->getOperand(1).getImm();
      MachineBasicBlock::iterator Call = prevNonDebug(Cmp);
      if (MI.getOpcode() == AVR32::SREQr && Imm == 0)
        return RetargetAndEraseCmp(Call, "__eqdf2", "__avr32_f64_cmp_eq",
                                   /*SwapArgs=*/false);
      if (MI.getOpcode() == AVR32::SRLTr && Imm == 0)
        return RetargetAndEraseCmp(Call, "__ltdf2", "__avr32_f64_cmp_lt",
                                   /*SwapArgs=*/false);
      if (MI.getOpcode() == AVR32::SRLTr && Imm == 1)
        return RetargetAndEraseCmp(Call, "__ledf2", "__avr32_f64_cmp_ge",
                                   /*SwapArgs=*/true);
      return false;
    }

    if (MI.getOpcode() != AVR32::SRLTr || Cmp->getOpcode() != AVR32::CPrr ||
        Cmp->getNumOperands() < 2 || !isRegOperand(Cmp->getOperand(0)) ||
        !isRegOperand(Cmp->getOperand(1)) ||
        Cmp->getOperand(1).getReg() != AVR32::R12)
      return false;

    Register TestReg = Cmp->getOperand(0).getReg();
    MachineBasicBlock::iterator Imm = prevNonDebug(Cmp);
    if (Imm == MBB.end())
      return false;

    MachineBasicBlock::iterator Call = prevNonDebug(Imm);
    if (isMoveImmToReg(*Imm, TestReg, 0)) {
      if (Call == MBB.end() ||
          !retargetDirectCall(*Call, "__gtdf2", "__avr32_f64_cmp_lt"))
        return false;
      insertF64ArgSwapBefore(*Call, TII);
    } else if (isMoveImmToReg(*Imm, TestReg, -1)) {
      if (Call == MBB.end() ||
          !retargetDirectCall(*Call, "__gedf2", "__avr32_f64_cmp_ge"))
        return false;
    } else {
      return false;
    }

    Imm->eraseFromParent();
    Cmp->eraseFromParent();
    MI.setDesc(TII.get(AVR32::SRNEr));
    ++NumCompactForms;
    return true;
  }

  if ((MI.getOpcode() != AVR32::MOVEQriCG &&
       MI.getOpcode() != AVR32::MOVLTriCG) ||
      MI.getNumOperands() < 3 || !isRegOperand(MI.getOperand(0)) ||
      !isRegOperand(MI.getOperand(1)) ||
      MI.getOperand(0).getReg() != MI.getOperand(1).getReg() ||
      !MI.getOperand(2).isImm() || MI.getOperand(2).getImm() != 1)
    return false;

  Register BoolReg = MI.getOperand(0).getReg();
  MachineBasicBlock &MBB = *MI.getParent();

  MachineBasicBlock::iterator Prev = prevNonDebug(MI.getIterator());
  if (Prev == MBB.end())
    return false;

  if (Prev->getOpcode() == AVR32::CPrr && Prev->getNumOperands() >= 2 &&
      isRegOperand(Prev->getOperand(0)) &&
      isRegOperand(Prev->getOperand(1))) {
    bool IsLTOrEQ = Prev->getOperand(0).getReg() == AVR32::R12 &&
                    Prev->getOperand(1).getReg() == BoolReg;
    bool IsGT = MI.getOpcode() == AVR32::MOVLTriCG &&
                Prev->getOperand(0).getReg() == BoolReg &&
                Prev->getOperand(1).getReg() == AVR32::R12;
    if (!IsLTOrEQ && !IsGT)
      return false;

    MachineBasicBlock::iterator Zero = prevNonDebug(Prev);
    if (Zero == MBB.end() || !isMoveImmToReg(*Zero, BoolReg, 0))
      return false;

    MachineBasicBlock::iterator Call = prevNonDebug(Zero);
    if (Call == MBB.end())
      return false;

    StringRef From;
    const char *To = nullptr;
    if (IsGT) {
      From = "__gtdf2";
      To = "__avr32_f64_cmp_lt";
    } else if (MI.getOpcode() == AVR32::MOVEQriCG) {
      From = "__eqdf2";
      To = "__avr32_f64_cmp_eq";
    } else {
      From = "__ltdf2";
      To = "__avr32_f64_cmp_lt";
    }

    if (!retargetDirectCall(*Call, From, To))
      return false;

    if (IsGT)
      insertF64ArgSwapBefore(*Call, TII);
    Prev->eraseFromParent();
    MI.setDesc(TII.get(AVR32::MOVNEriCG));
    ++NumCompactForms;
    return true;
  }

  if (MI.getOpcode() != AVR32::MOVLTriCG ||
      !isMoveImmToReg(*Prev, BoolReg, 0))
    return false;

  MachineBasicBlock::iterator Cmp = prevNonDebug(Prev);
  if (Cmp == MBB.end())
    return false;

  if (isImmediateCompareOpcode(Cmp->getOpcode()) &&
      Cmp->getNumOperands() >= 2 && isRegOperand(Cmp->getOperand(0)) &&
      Cmp->getOperand(0).getReg() == AVR32::R12 &&
      Cmp->getOperand(1).isImm() && Cmp->getOperand(1).getImm() == 1) {
    MachineBasicBlock::iterator Call = prevNonDebug(Cmp);
    if (Call == MBB.end() ||
        !retargetDirectCall(*Call, "__ledf2", "__avr32_f64_cmp_ge"))
      return false;

    insertF64ArgSwapBefore(*Call, TII);
    Cmp->eraseFromParent();
    MI.setDesc(TII.get(AVR32::MOVNEriCG));
    ++NumCompactForms;
    return true;
  }

  if (Cmp->getOpcode() != AVR32::CPrr || Cmp->getNumOperands() < 2 ||
      !isRegOperand(Cmp->getOperand(0)) || !isRegOperand(Cmp->getOperand(1)) ||
      Cmp->getOperand(1).getReg() != AVR32::R12)
    return false;

  Register MinusOneReg = Cmp->getOperand(0).getReg();
  MachineBasicBlock::iterator MinusOne = prevNonDebug(Cmp);
  if (MinusOne == MBB.end() ||
      !isMoveImmToReg(*MinusOne, MinusOneReg, -1))
    return false;

  MachineBasicBlock::iterator Call = prevNonDebug(MinusOne);
  if (Call == MBB.end() ||
      !retargetDirectCall(*Call, "__gedf2", "__avr32_f64_cmp_ge"))
    return false;

  MinusOne->eraseFromParent();
  Cmp->eraseFromParent();
  MI.setDesc(TII.get(AVR32::MOVNEriCG));
  ++NumCompactForms;
  return true;
}

bool AVR32Peephole::foldShiftedMaskIndexLoad(
    MachineInstr &MI, const TargetInstrInfo &TII,
    const TargetRegisterInfo &TRI) {
  if (MI.getOpcode() != AVR32::LD_W_IndexShift || MI.getNumOperands() != 4 ||
      !isRegOperand(MI.getOperand(0)) || !isRegOperand(MI.getOperand(2)) ||
      !MI.getOperand(3).isImm())
    return false;

  Register IndexReg = MI.getOperand(2).getReg();
  if (MI.getOperand(0).getReg() != IndexReg && !MI.getOperand(2).isKill())
    return false;

  MachineBasicBlock &MBB = *MI.getParent();
  MachineBasicBlock::iterator AndIt = MBB.end();
  MachineBasicBlock::iterator I = MI.getIterator();
  for (unsigned Depth = 0; I != MBB.begin() && Depth < 4;) {
    --I;
    if (I->isDebugInstr())
      continue;
    if (I->getOpcode() == AVR32::ANDrr && I->getNumOperands() == 2 &&
        isRegOperand(I->getOperand(0)) &&
        I->getOperand(0).getReg() == IndexReg) {
      AndIt = I;
      break;
    }
    if (I->readsRegister(IndexReg, &TRI) || I->modifiesRegister(IndexReg, &TRI))
      return false;
    ++Depth;
  }
  if (AndIt == MBB.end() || !isRegOperand(AndIt->getOperand(1)) ||
      !AndIt->getOperand(1).isKill())
    return false;

  Register MaskReg = AndIt->getOperand(1).getReg();
  if (MaskReg == IndexReg)
    return false;

  MachineBasicBlock::iterator MaskIt = prevNonDebug(AndIt);
  if (MaskIt == MBB.end() || !isMovLowImmOpcode(MaskIt->getOpcode()) ||
      MaskIt->getNumOperands() != 2 || !isRegOperand(MaskIt->getOperand(0)) ||
      !MaskIt->getOperand(1).isImm() ||
      MaskIt->getOperand(0).getReg() != MaskReg)
    return false;

