cozycactus/llvm-project/llvm/lib/Target/AVR32/AVR32Peephole.cpp
  MachineBasicBlock::iterator LsrIt = prevNonDebug(MaskIt);
  if (LsrIt == MBB.end() || LsrIt->getOpcode() != AVR32::LSRrrr ||
      LsrIt->getNumOperands() != 3 || !isRegOperand(LsrIt->getOperand(0)) ||
      !isRegOperand(LsrIt->getOperand(1)) ||
      !isRegOperand(LsrIt->getOperand(2)) ||
      LsrIt->getOperand(0).getReg() != IndexReg)
    return false;

  Register SrcReg = LsrIt->getOperand(1).getReg();
  Register ShiftReg = LsrIt->getOperand(2).getReg();
  if (ShiftReg == SrcReg)
    return false;

  MachineBasicBlock::iterator ShiftIt = prevNonDebug(LsrIt);
  if (ShiftIt == MBB.end() || !isMovLowImmOpcode(ShiftIt->getOpcode()) ||
      ShiftIt->getNumOperands() != 2 ||
      !isRegOperand(ShiftIt->getOperand(0)) ||
      !ShiftIt->getOperand(1).isImm() ||
      ShiftIt->getOperand(0).getReg() != ShiftReg)
    return false;

  int64_t ShiftImm = ShiftIt->getOperand(1).getImm();
  if (ShiftImm < 0 || ShiftImm > 31)
    return false;

  unsigned MaskIdx = 0;
  unsigned MaskLen = 0;
  uint32_t Mask = static_cast<uint32_t>(MaskIt->getOperand(1).getImm());
  if (!isShiftedMask_32(Mask, MaskIdx, MaskLen) || Mask == UINT32_MAX)
    return false;

  int64_t OldLoadShift = MI.getOperand(3).getImm();
  if (OldLoadShift < 0 || OldLoadShift > 3)
    return false;

  unsigned NewBitPos = static_cast<unsigned>(ShiftImm) + MaskIdx;
  unsigned NewLoadShift = static_cast<unsigned>(OldLoadShift) + MaskIdx;
  if (NewBitPos > 31 || NewLoadShift > 3)
    return false;

  MachineFunction &MF = *MBB.getParent();
  MachineInstrBuilder Extract =
      BuildMI(MBB, ShiftIt, LsrIt->getDebugLoc(), TII.get(AVR32::BFEXTU),
              IndexReg)
          .addReg(SrcReg, getKillRegState(LsrIt->getOperand(1).isKill()))
          .addImm(NewBitPos)
          .addImm(MaskLen);
  Extract.setMIFlags(LsrIt->getFlags());
  Extract->copyImplicitOps(MF, *LsrIt);

  MI.getOperand(3).setImm(NewLoadShift);
  ShiftIt->eraseFromParent();
  LsrIt->eraseFromParent();
  MaskIt->eraseFromParent();
  AndIt->eraseFromParent();
  ++NumCompactForms;
  return true;
}

static bool isRegRegImmShift16(const MachineInstr &MI, unsigned Opcode,
                               Register Reg) {
  return MI.getOpcode() == Opcode && MI.getNumOperands() >= 3 &&
         isRegOperand(MI.getOperand(0)) && isRegOperand(MI.getOperand(1)) &&
         MI.getOperand(0).getReg() == Reg &&
         MI.getOperand(1).getReg() == Reg && MI.getOperand(2).isImm() &&
         MI.getOperand(2).getImm() == 16;
}

bool AVR32Peephole::foldRotate16(MachineInstr &MI,
                                 const TargetInstrInfo &TII) {
  if (MI.getNumOperands() < 3 || !isRegOperand(MI.getOperand(0)) ||
      !isRegOperand(MI.getOperand(1)) || !isRegOperand(MI.getOperand(2)) ||
      hasLiveSRegDef(MI))
    return false;

  Register DstReg = MI.getOperand(0).getReg();
  Register LHSReg = MI.getOperand(1).getReg();
  Register RHSReg = MI.getOperand(2).getReg();
  Register TmpReg;
  unsigned TmpOpIdx;
  if (LHSReg == DstReg && RHSReg != DstReg) {
    TmpReg = RHSReg;
    TmpOpIdx = 2;
  } else if (MI.getOpcode() == AVR32::ORALrrr && RHSReg == DstReg &&
             LHSReg != DstReg) {
    TmpReg = LHSReg;
    TmpOpIdx = 1;
  } else {
    return false;
  }

  if (!MI.getOperand(TmpOpIdx).isKill())
    return false;

  MachineBasicBlock::iterator SecondShiftIt = prevNonDebug(MI.getIterator());
  if (SecondShiftIt == MI.getParent()->end())
    return false;
  MachineBasicBlock::iterator FirstShiftIt = prevNonDebug(SecondShiftIt);
  if (FirstShiftIt == MI.getParent()->end())
    return false;

  bool FirstIsLsrTmp =
      isRegRegImmShift16(*FirstShiftIt, AVR32::LSRricg, TmpReg);
  bool FirstIsLslTmp =
      isRegRegImmShift16(*FirstShiftIt, AVR32::LSLricg, TmpReg);
  bool FirstIsLslDst =
      isRegRegImmShift16(*FirstShiftIt, AVR32::LSLricg, DstReg);
  bool FirstIsLsrDst =
      isRegRegImmShift16(*FirstShiftIt, AVR32::LSRricg, DstReg);
  bool SecondIsLsrTmp =
      isRegRegImmShift16(*SecondShiftIt, AVR32::LSRricg, TmpReg);
  bool SecondIsLslTmp =
      isRegRegImmShift16(*SecondShiftIt, AVR32::LSLricg, TmpReg);
  bool SecondIsLslDst =
      isRegRegImmShift16(*SecondShiftIt, AVR32::LSLricg, DstReg);
  bool SecondIsLsrDst =
      isRegRegImmShift16(*SecondShiftIt, AVR32::LSRricg, DstReg);
  if (!((FirstIsLsrTmp && SecondIsLslDst) ||
        (FirstIsLslDst && SecondIsLsrTmp) ||
        (FirstIsLslTmp && SecondIsLsrDst) ||
        (FirstIsLsrDst && SecondIsLslTmp)))
    return false;

  MachineBasicBlock::iterator CopyIt = prevNonDebug(FirstShiftIt);
  if (CopyIt == MI.getParent()->end() ||
      CopyIt->getOpcode() != AVR32::MOVrr || CopyIt->getNumOperands() < 2 ||
      !isRegOperand(CopyIt->getOperand(0)) ||
      !isRegOperand(CopyIt->getOperand(1)) ||
      CopyIt->getOperand(0).getReg() != TmpReg ||
      CopyIt->getOperand(1).getReg() != DstReg)
    return false;

  MachineBasicBlock &MBB = *MI.getParent();
  BuildMI(MBB, CopyIt, CopyIt->getDebugLoc(), TII.get(AVR32::SWAP_Hcg),
          DstReg)
      .addReg(DstReg, getKillRegState(CopyIt->getOperand(1).isKill()))
      .setMIFlags(MI.getFlags());

  CopyIt->eraseFromParent();
  FirstShiftIt->eraseFromParent();
  SecondShiftIt->eraseFromParent();
  MI.eraseFromParent();
  ++NumCompactForms;
  return true;
}

static std::optional<unsigned> getCastWidth(unsigned Opcode, bool &Signed) {
  Signed = false;
  switch (Opcode) {
  case AVR32::CASTU_Bcg:
    return 8;
  case AVR32::CASTU_Hcg:
    return 16;
  case AVR32::CASTS_Bcg:
    Signed = true;
    return 8;
  case AVR32::CASTS_Hcg:
    Signed = true;
    return 16;
  default:
    return std::nullopt;
  }
}

static unsigned getNarrowCompareOpcode(unsigned Width) {
  switch (Width) {
  case 8:
    return AVR32::CP_Brr;
  case 16:
    return AVR32::CP_Hrr;
  default:
    return 0;
  }
}

static bool immediateFitsNarrowCompare(int64_t Imm, bool Signed,
                                       unsigned Width) {
  if (Signed)
    return isSignedNBit(Imm, Width);
  return Imm >= 0 && static_cast<uint64_t>(Imm) < (uint64_t(1) << Width);
}

static unsigned getMoveImmediateOpcode(int64_t Imm) {
  return isSignedNBit(Imm, 8) ? AVR32::MOVri8 : AVR32::MOVri21;
}

bool AVR32Peephole::foldNarrowCompare(MachineInstr &MI,
                                      const TargetInstrInfo &TII,
                                      const TargetRegisterInfo &TRI) {
  if (!isCompareOpcode(MI.getOpcode()) || MI.getNumOperands() != 2 ||
      !isRegOperand(MI.getOperand(0)) || !MI.getOperand(0).isKill())
    return false;
  if (!hasCompatibleNarrowCompareUser(MI, /*Signed=*/false) &&
      !hasCompatibleNarrowCompareUser(MI, /*Signed=*/true))
    return false;

  MachineBasicBlock::iterator CastIt = MI.getIterator();
  if (CastIt == MI.getParent()->begin())
    return false;
  --CastIt;
  while (CastIt->isDebugInstr()) {
    if (CastIt == MI.getParent()->begin())
      return false;
    --CastIt;
  }

  bool Signed = false;
  std::optional<unsigned> Width = getCastWidth(CastIt->getOpcode(), Signed);
  if (!Width || !hasCompatibleNarrowCompareUser(MI, Signed))
    return false;
  unsigned NarrowOpc = getNarrowCompareOpcode(*Width);
  if (!NarrowOpc || CastIt->getNumExplicitOperands() != 2 ||
      !isRegOperand(CastIt->getOperand(0)) ||
      !isRegOperand(CastIt->getOperand(1)))
    return false;

  Register CastReg = CastIt->getOperand(0).getReg();
  if (CastReg != CastIt->getOperand(1).getReg() ||
      CastReg != MI.getOperand(0).getReg())
    return false;

  MachineBasicBlock::iterator CopyIt = CastIt;
  if (CopyIt == MI.getParent()->begin())
    return false;
  --CopyIt;
  while (CopyIt->isDebugInstr()) {
    if (CopyIt == MI.getParent()->begin())
      return false;
    --CopyIt;
  }
  if (CopyIt->getOpcode() != AVR32::MOVrr || CopyIt->getNumOperands() != 2 ||
      !isRegOperand(CopyIt->getOperand(0)) ||
      !isRegOperand(CopyIt->getOperand(1)) ||
      CopyIt->getOperand(0).getReg() != CastReg)
    return false;

