cozycactus/llvm-project/llvm/lib/Target/AVR32/AVR32Peephole.cpp
  Register SrcReg = CopyIt->getOperand(1).getReg();
  if (SrcReg == CastReg)
    return false;

  MachineBasicBlock &MBB = *MI.getParent();
  MachineFunction &MF = *MBB.getParent();
  unsigned OldSize = getInstSize(*CopyIt) + getInstSize(*CastIt) +
                     getInstSize(MI);

  if (isImmediateCompareOpcode(MI.getOpcode())) {
    if (!MI.getOperand(1).isImm())
      return false;
    int64_t Imm = MI.getOperand(1).getImm();
    if (!immediateFitsNarrowCompare(Imm, Signed, *Width))
      return false;

    unsigned MovOpc = getMoveImmediateOpcode(Imm);
    unsigned NewSize = TII.get(MovOpc).getSize() + TII.get(NarrowOpc).getSize();
    if (NewSize >= OldSize)
      return false;

    BuildMI(MBB, CopyIt, CopyIt->getDebugLoc(), TII.get(MovOpc), CastReg)
        .addImm(Imm)
        .setMIFlags(CopyIt->getFlags());
    MachineInstrBuilder Cmp =
        BuildMI(MBB, CopyIt, MI.getDebugLoc(), TII.get(NarrowOpc))
            .addReg(SrcReg, getKillRegState(CopyIt->getOperand(1).isKill()))
            .addReg(CastReg, RegState::Kill);
    Cmp.setMIFlags(MI.getFlags());
    Cmp->copyImplicitOps(MF, MI);
  } else {
    if (!isRegOperand(MI.getOperand(1)))
      return false;
    Register RHSReg = MI.getOperand(1).getReg();
    if (!isRegAlreadyExtendedBefore(MI.getIterator(), RHSReg, Signed, *Width,
                                    TRI))
      return false;

    unsigned NewSize = TII.get(NarrowOpc).getSize();
    if (NewSize >= OldSize)
      return false;

    MachineInstrBuilder Cmp =
        BuildMI(MBB, CopyIt, MI.getDebugLoc(), TII.get(NarrowOpc))
            .addReg(SrcReg, getKillRegState(CopyIt->getOperand(1).isKill()))
            .addReg(RHSReg, getKillRegState(MI.getOperand(1).isKill()));
    Cmp.setMIFlags(MI.getFlags());
    Cmp->copyImplicitOps(MF, MI);
  }

  CopyIt->eraseFromParent();
  CastIt->eraseFromParent();
  MI.eraseFromParent();
  ++NumCompactForms;
  return true;
}

bool AVR32Peephole::foldRedundantCastBeforeCompare(
    MachineInstr &MI, const TargetRegisterInfo &TRI) {
  bool Signed = false;
  unsigned Width = 0;
  switch (MI.getOpcode()) {
  case AVR32::CASTU_Bcg:
    Width = 8;
    break;
  case AVR32::CASTU_Hcg:
    Width = 16;
    break;
  case AVR32::CASTS_Bcg:
    Signed = true;
    Width = 8;
    break;
  case AVR32::CASTS_Hcg:
    Signed = true;
    Width = 16;
    break;
  default:
    return false;
  }

  if (MI.getNumExplicitOperands() != 2 || !isRegOperand(MI.getOperand(0)) ||
      !isRegOperand(MI.getOperand(1)) ||
      MI.getOperand(0).getReg() != MI.getOperand(1).getReg())
    return false;

  MachineBasicBlock::iterator NextIt = std::next(MI.getIterator());
  MachineBasicBlock &MBB = *MI.getParent();
  while (NextIt != MBB.end() && NextIt->isDebugInstr())
    ++NextIt;
  if (NextIt == MBB.end())
    return false;

  Register Reg = MI.getOperand(0).getReg();
  if (!compareUsesReg(*NextIt, Reg))
    return false;
  if (!isRegAlreadyExtendedBefore(MI.getIterator(), Reg, Signed, Width, TRI))
    return false;

  MI.eraseFromParent();
  ++NumCompactForms;
  return true;
}

bool AVR32Peephole::foldNearBranches(MachineFunction &MF,
                                     const TargetInstrInfo &TII) {
  DenseMap<const MachineBasicBlock *, uint64_t> BlockOffsets;
  DenseMap<const MachineInstr *, uint64_t> InstrOffsets;
  uint64_t Offset = 0;
  for (const MachineBasicBlock &MBB : MF) {
    BlockOffsets[&MBB] = Offset;
    for (const MachineInstr &MI : MBB) {
      InstrOffsets[&MI] = Offset;
      Offset += getInstSize(MI);
    }
  }

  bool Changed = false;
  for (MachineBasicBlock &MBB : MF) {
    for (MachineBasicBlock::iterator I = MBB.begin(), E = MBB.end(); I != E;) {
      MachineInstr &MI = *I++;
      unsigned CompactOpc = 0;
      int64_t MinDisp = 0;
      int64_t MaxDisp = 0;

      if (MI.getOpcode() == AVR32::BRALbb) {
        CompactOpc = AVR32::RJMPbb;
        MinDisp = -1000;
        MaxDisp = 998;
      } else if (std::optional<unsigned> Opc =
                     getCompactBranchOpcode(MI.getOpcode())) {
        CompactOpc = *Opc;
        MinDisp = -248;
        MaxDisp = 246;
      } else {
        continue;
      }

      if (MI.getNumOperands() != 1 || !MI.getOperand(0).isMBB())
        continue;

      const MachineBasicBlock *Target = MI.getOperand(0).getMBB();
      int64_t BranchOffset = static_cast<int64_t>(InstrOffsets.lookup(&MI));
      int64_t TargetOffset = static_cast<int64_t>(BlockOffsets.lookup(Target));
      int64_t Disp = TargetOffset - BranchOffset;
      if (Disp < MinDisp || Disp > MaxDisp || (Disp & 1))
        continue;

      BuildMI(MBB, MI, MI.getDebugLoc(), TII.get(CompactOpc))
          .addMBB(MI.getOperand(0).getMBB())
          .setMIFlags(MI.getFlags());
      MI.eraseFromParent();
      ++NumCompactForms;
      Changed = true;
    }
  }

  return Changed;
}

bool AVR32Peephole::foldPredicatedStores(MachineFunction &MF,
                                         const TargetInstrInfo &TII) {
  for (MachineBasicBlock &MBB : MF) {
    if (MBB.empty())
      continue;

    MachineInstr *Branch = nullptr;
    for (MachineInstr &MI : llvm::reverse(MBB)) {
      if (MI.isDebugInstr())
        continue;
      Branch = &MI;
      break;
    }
    if (!Branch || Branch->getNumOperands() != 1 ||
        !Branch->getOperand(0).isMBB())
      continue;

    std::optional<AVR32Cond> StoreCond =
        getStoreConditionForSkippedBranch(Branch->getOpcode());
    if (!StoreCond)
      continue;

    MachineBasicBlock::iterator Prev = prevNonDebug(Branch->getIterator());
    if (Prev == MBB.end() || !isCompareOpcode(Prev->getOpcode()))
      continue;

    MachineBasicBlock *SkipBB = Branch->getOperand(0).getMBB();
    MachineFunction::iterator StoreIt = std::next(MBB.getIterator());
    if (StoreIt == MF.end())
      continue;
    MachineBasicBlock *StoreBB = &*StoreIt;
    if (std::next(StoreIt) == MF.end() || &*std::next(StoreIt) != SkipBB)
      continue;
    if (StoreBB->succ_size() != 1 || *StoreBB->succ_begin() != SkipBB)
      continue;
    if (!MBB.isSuccessor(StoreBB) || !MBB.isSuccessor(SkipBB))
      continue;
    if (!SkipBB->empty() && SkipBB->begin()->isPHI())
      continue;

    MachineInstr *Store = nullptr;
    bool HasOtherNonDebug = false;
    for (MachineInstr &MI : *StoreBB) {
      if (MI.isDebugInstr())
        continue;
      if (!Store)
        Store = &MI;
      else
        HasOtherNonDebug = true;
    }
    if (!Store || HasOtherNonDebug || Store->getNumOperands() != 3)
      continue;

    const MachineOperand &Base = Store->getOperand(0);
    const MachineOperand &Disp = Store->getOperand(1);
    const MachineOperand &Src = Store->getOperand(2);
    if (!isRegOperand(Base) || !Disp.isImm() || !isRegOperand(Src) ||
        !fitsPredicatedStoreDisp(Store->getOpcode(), Disp.getImm()))
      continue;

