cozycactus/llvm-project/llvm/lib/Target/AVR32/AVR32Peephole.cpp
    std::optional<unsigned> CondStoreOpc =
        getPredicatedStoreOpcode(Store->getOpcode(), *StoreCond);
    if (!CondStoreOpc)
      continue;
    if (!Store->mayStore() || Store->mayLoad())
      continue;

    MachineInstrBuilder MIB =
        BuildMI(MBB, *Branch, Store->getDebugLoc(), TII.get(*CondStoreOpc))
            .addReg(Base.getReg(), getKillRegState(Base.isKill()))
            .addImm(Disp.getImm())
            .addReg(Src.getReg(), getKillRegState(Src.isKill()));
    MIB->copyImplicitOps(MF, *Store);
    MIB.setMIFlags(Store->getFlags());
    MIB.setMemRefs(Store->memoperands());

    Branch->eraseFromParent();
    MBB.removeSuccessor(StoreBB);
    StoreBB->removeSuccessor(SkipBB);
    StoreBB->eraseFromParent();

    ++NumPredicatedStores;
    return true;
  }

  return false;
}

bool AVR32Peephole::foldLoadDisp(MachineInstr &MI, unsigned CompactOpc,
                                 unsigned MaxDisp, unsigned Align,
                                 const TargetInstrInfo &TII) {
  if (MI.getNumOperands() != 3)
    return false;

  const MachineOperand &Dst = MI.getOperand(0);
  const MachineOperand &Base = MI.getOperand(1);
  const MachineOperand &Disp = MI.getOperand(2);
  if (!isRegOperand(Dst) || !isRegOperand(Base) || !Disp.isImm() ||
      !isCompactDisp(Disp.getImm(), MaxDisp, Align))
    return false;

  MachineBasicBlock &MBB = *MI.getParent();
  MachineFunction &MF = *MBB.getParent();
  MachineInstrBuilder MIB =
      BuildMI(MBB, MI, MI.getDebugLoc(), TII.get(CompactOpc), Dst.getReg())
          .addReg(Base.getReg(), getKillRegState(Base.isKill()))
          .addImm(Disp.getImm());
  MIB.setMIFlags(MI.getFlags());
  MIB->copyImplicitOps(MF, MI);
  MIB.setMemRefs(MI.memoperands());
  MI.eraseFromParent();
  ++NumCompactForms;
  return true;
}

bool AVR32Peephole::foldStoreDisp(MachineInstr &MI, unsigned CompactOpc,
                                  unsigned MaxDisp, unsigned Align,
                                  const TargetInstrInfo &TII) {
  if (MI.getNumOperands() != 3)
    return false;

  const MachineOperand &Base = MI.getOperand(0);
  const MachineOperand &Disp = MI.getOperand(1);
  const MachineOperand &Src = MI.getOperand(2);
  if (!isRegOperand(Base) || !Disp.isImm() || !isRegOperand(Src) ||
      !isCompactDisp(Disp.getImm(), MaxDisp, Align))
    return false;

  MachineBasicBlock &MBB = *MI.getParent();
  MachineFunction &MF = *MBB.getParent();
  MachineInstrBuilder MIB =
      BuildMI(MBB, MI, MI.getDebugLoc(), TII.get(CompactOpc))
          .addReg(Base.getReg(), getKillRegState(Base.isKill()))
          .addImm(Disp.getImm())
          .addReg(Src.getReg(), getKillRegState(Src.isKill()));
  MIB.setMIFlags(MI.getFlags());
  MIB->copyImplicitOps(MF, MI);
  MIB.setMemRefs(MI.memoperands());
  MI.eraseFromParent();
  ++NumCompactForms;
  return true;
}

bool AVR32Peephole::foldSPLoadDisp(MachineInstr &MI,
                                   const TargetInstrInfo &TII) {
  if (MI.getNumOperands() != 3)
    return false;

  const MachineOperand &Dst = MI.getOperand(0);
  const MachineOperand &Base = MI.getOperand(1);
  const MachineOperand &Disp = MI.getOperand(2);
  if (!isRegOperand(Dst) || !isRegOperand(Base) || Base.getReg() != AVR32::SP ||
      !Disp.isImm() || !isCompactDisp(Disp.getImm(), 508, 4))
    return false;

  MachineBasicBlock &MBB = *MI.getParent();
  MachineFunction &MF = *MBB.getParent();
  MachineInstrBuilder MIB =
      BuildMI(MBB, MI, MI.getDebugLoc(), TII.get(AVR32::LDDSP), Dst.getReg())
          .addReg(AVR32::SP, getKillRegState(Base.isKill()))
          .addImm(Disp.getImm());
  MIB.setMIFlags(MI.getFlags());
  MIB->copyImplicitOps(MF, MI);
  MIB.setMemRefs(MI.memoperands());
  MI.eraseFromParent();
  ++NumCompactForms;
  return true;
}

bool AVR32Peephole::foldSPStoreDisp(MachineInstr &MI,
                                    const TargetInstrInfo &TII) {
  if (MI.getNumOperands() != 3)
    return false;

  const MachineOperand &Base = MI.getOperand(0);
  const MachineOperand &Disp = MI.getOperand(1);
  const MachineOperand &Src = MI.getOperand(2);
  if (!isRegOperand(Base) || Base.getReg() != AVR32::SP || !Disp.isImm() ||
      !isRegOperand(Src) || !isCompactDisp(Disp.getImm(), 508, 4))
    return false;

  MachineBasicBlock &MBB = *MI.getParent();
  MachineFunction &MF = *MBB.getParent();
  MachineInstrBuilder MIB =
      BuildMI(MBB, MI, MI.getDebugLoc(), TII.get(AVR32::STDSP))
          .addReg(AVR32::SP, getKillRegState(Base.isKill()))
          .addImm(Disp.getImm())
          .addReg(Src.getReg(), getKillRegState(Src.isKill()));
  MIB.setMIFlags(MI.getFlags());
  MIB->copyImplicitOps(MF, MI);
  MIB.setMemRefs(MI.memoperands());
  MI.eraseFromParent();
  ++NumCompactForms;
  return true;
}

bool AVR32Peephole::foldDoublewordLoad(MachineInstr &MI,
                                       const TargetInstrInfo &TII) {
  if (!isDoublewordFoldableLoadOpcode(MI.getOpcode()) ||
      MI.getNumOperands() != 3 || hasOrderedMemOperand(MI))
    return false;

  MachineBasicBlock::iterator PrevIt = prevNonDebug(MI.getIterator());
  if (PrevIt == MI.getParent()->end())
    return false;
  MachineInstr &PrevMI = *PrevIt;
  if (!isDoublewordFoldableLoadOpcode(PrevMI.getOpcode()) ||
      PrevMI.getNumOperands() != 3 || hasOrderedMemOperand(PrevMI))
    return false;

  const MachineInstr *LowAddrMI = nullptr;
  const MachineOperand *LowDst = nullptr;
  const MachineOperand *HighDst = nullptr;

  const MachineOperand &PrevDst = PrevMI.getOperand(0);
  const MachineOperand &CurDst = MI.getOperand(0);
  if (!isRegOperand(PrevDst) || !isRegOperand(CurDst))
    return false;

  Register PrevReg = PrevDst.getReg();
  Register CurReg = CurDst.getReg();
  if (getDoublewordHighReg(CurReg) == PrevReg &&
      hasSameBaseAndDisp(PrevMI, MI, false)) {
    LowAddrMI = &PrevMI;
    LowDst = &CurDst;
    HighDst = &PrevDst;
  } else if (getDoublewordHighReg(PrevReg) == CurReg &&
             hasSameBaseAndDisp(MI, PrevMI, false)) {
    LowAddrMI = &MI;
    LowDst = &PrevDst;
    HighDst = &CurDst;
  } else {
    return false;
  }

