cozycactus/llvm-project/llvm/lib/Target/AVR32/AVR32Peephole.cpp
  Register LowReg = LowDst->getReg();
  Register HighReg = HighDst->getReg();

  MachineBasicBlock &MBB = *MI.getParent();
  MachineFunction &MF = *MBB.getParent();
  SmallVector<MachineMemOperand *, 2> MemRefs;
  llvm::append_range(MemRefs, PrevMI.memoperands());
  llvm::append_range(MemRefs, MI.memoperands());

  MachineInstrBuilder MIB =
      BuildMI(MBB, PrevMI, PrevMI.getDebugLoc(), TII.get(AVR32::LD_D_Disp16))
          .addReg(LowReg,
                  RegState::Define | getDeadRegState(LowDst->isDead()))
          .addReg(LowAddrMI->getOperand(1).getReg(),
                  getKillRegState(PrevMI.getOperand(1).isKill() ||
                                  MI.getOperand(1).isKill()))
          .addImm(LowAddrMI->getOperand(2).getImm())
          .addReg(HighReg, RegState::Implicit | RegState::Define |
                               getDeadRegState(HighDst->isDead()));
  MIB.setMIFlags(PrevMI.getFlags());
  MIB->copyImplicitOps(MF, PrevMI);
  MIB.setMemRefs(MemRefs);

  PrevMI.eraseFromParent();
  MI.eraseFromParent();
  ++NumDoublewordMemOps;
  return true;
}

bool AVR32Peephole::foldDoublewordStore(MachineInstr &MI,
                                        const TargetInstrInfo &TII) {
  if (!isDoublewordFoldableStoreOpcode(MI.getOpcode()) ||
      MI.getNumOperands() != 3 || hasOrderedMemOperand(MI))
    return false;

  MachineBasicBlock::iterator PrevIt = prevNonDebug(MI.getIterator());
  if (PrevIt == MI.getParent()->end())
    return false;
  MachineInstr &PrevMI = *PrevIt;
  if (!isDoublewordFoldableStoreOpcode(PrevMI.getOpcode()) ||
      PrevMI.getNumOperands() != 3 || hasOrderedMemOperand(PrevMI))
    return false;

  const MachineInstr *LowAddrMI = nullptr;
  const MachineOperand *LowSrc = nullptr;
  const MachineOperand *HighSrc = nullptr;

  const MachineOperand &PrevSrc = PrevMI.getOperand(2);
  const MachineOperand &CurSrc = MI.getOperand(2);
  if (!isRegOperand(PrevSrc) || !isRegOperand(CurSrc))
    return false;

  Register PrevReg = PrevSrc.getReg();
  Register CurReg = CurSrc.getReg();
  if (getDoublewordHighReg(CurReg) == PrevReg &&
      hasSameBaseAndDisp(PrevMI, MI, true)) {
    LowAddrMI = &PrevMI;
    LowSrc = &CurSrc;
    HighSrc = &PrevSrc;
  } else if (getDoublewordHighReg(PrevReg) == CurReg &&
             hasSameBaseAndDisp(MI, PrevMI, true)) {
    LowAddrMI = &MI;
    LowSrc = &PrevSrc;
    HighSrc = &CurSrc;
  } else {
    return false;
  }

  Register LowReg = LowSrc->getReg();
  Register HighReg = HighSrc->getReg();

  MachineBasicBlock &MBB = *MI.getParent();
  MachineFunction &MF = *MBB.getParent();
  SmallVector<MachineMemOperand *, 2> MemRefs;
  llvm::append_range(MemRefs, PrevMI.memoperands());
  llvm::append_range(MemRefs, MI.memoperands());

  MachineInstrBuilder MIB =
      BuildMI(MBB, PrevMI, PrevMI.getDebugLoc(), TII.get(AVR32::ST_D_Disp16))
          .addReg(LowAddrMI->getOperand(0).getReg(),
                  getKillRegState(PrevMI.getOperand(0).isKill() ||
                                  MI.getOperand(0).isKill()))
          .addImm(LowAddrMI->getOperand(1).getImm())
          .addReg(LowReg, getKillRegState(LowSrc->isKill()))
          .addReg(HighReg,
                  RegState::Implicit | getKillRegState(HighSrc->isKill()));
  MIB.setMIFlags(PrevMI.getFlags());
  MIB->copyImplicitOps(MF, PrevMI);
  MIB.setMemRefs(MemRefs);

  PrevMI.eraseFromParent();
  MI.eraseFromParent();
  ++NumDoublewordMemOps;
  return true;
}

bool AVR32Peephole::repairCompareBranchFlagClobbers(
    MachineFunction &MF, const TargetRegisterInfo &TRI) {
  bool Changed = false;

  for (MachineBasicBlock &MBB : MF) {
    for (MachineBasicBlock::iterator Branch = MBB.begin(), E = MBB.end();
         Branch != E; ++Branch) {
      if (!isConditionalBranchOpcode(Branch->getOpcode()))
        continue;

      MachineBasicBlock::iterator Scan = Branch;
      bool HasFlagClobber = false;
      while (Scan != MBB.begin()) {
        MachineBasicBlock::iterator Prev = std::prev(Scan);
        if (Prev->isDebugInstr()) {
          Scan = Prev;
          continue;
        }

        if (isCompareOpcode(Prev->getOpcode())) {
          if (!HasFlagClobber)
            break;

          MachineBasicBlock::iterator WindowBegin = std::next(Prev);
          bool CanMoveWindow = true;
          for (MachineBasicBlock::iterator It = WindowBegin; It != Branch;
               ++It) {
            if (!isMovableAcrossCompare(*It, TRI) ||
                definesAnyCompareInput(*It, *Prev, TRI)) {
              CanMoveWindow = false;
              break;
            }
          }
          if (!CanMoveWindow)
            break;

          Prev->clearKillInfo();
          for (MachineBasicBlock::iterator It = WindowBegin; It != Branch;
               ++It)
            It->clearKillInfo();
          MBB.splice(Prev, &MBB, WindowBegin, Branch);
          Changed = true;
          break;
        }

        if (!isMovableAcrossCompare(*Prev, TRI))
          break;
        if (Prev->modifiesRegister(AVR32::SREG, &TRI))
          HasFlagClobber = true;
        Scan = Prev;
      }
    }
  }

  return Changed;
}

bool AVR32Peephole::foldSignedImmediate(MachineInstr &MI, unsigned CompactOpc,
                                        unsigned Bits, bool HasDef,
                                        const TargetInstrInfo &TII) {
  if (MI.getNumOperands() != 2)
    return false;

  const MachineOperand &RegOp = MI.getOperand(0);
  const MachineOperand &ImmOp = MI.getOperand(1);
  if (!isRegOperand(RegOp) || !ImmOp.isImm() ||
      !isSignedNBit(ImmOp.getImm(), Bits))
    return false;

  MachineBasicBlock &MBB = *MI.getParent();
  MachineFunction &MF = *MBB.getParent();
  MachineInstrBuilder MIB =
      HasDef ? BuildMI(MBB, MI, MI.getDebugLoc(), TII.get(CompactOpc),
                       RegOp.getReg())
             : BuildMI(MBB, MI, MI.getDebugLoc(), TII.get(CompactOpc));
  if (!HasDef)
    MIB.addReg(RegOp.getReg(), getKillRegState(RegOp.isKill()));
  MIB.addImm(ImmOp.getImm());
  MIB.setMIFlags(MI.getFlags());
  MIB->copyImplicitOps(MF, MI);
  MI.eraseFromParent();
  ++NumCompactForms;
  return true;
}

bool AVR32Peephole::repairDivRemainderClobbers(
    MachineFunction &MF, const TargetInstrInfo &TII,
    const TargetRegisterInfo &TRI) {
  MachineRegisterInfo &MRI = MF.getRegInfo();
  bool Changed = false;

  for (MachineBasicBlock &MBB : MF) {
    LivePhysRegs Live(TRI);
    Live.addLiveOutsNoPristines(MBB);

    for (MachineBasicBlock::iterator I = MBB.end(); I != MBB.begin();) {
      --I;
      MachineInstr &MI = *I;
      MachineInstr *InsertedCopy = nullptr;
      MachineInstr *InsertedReload = nullptr;

      if (isQuotientOnlyDivOpcode(MI.getOpcode()) && MI.getNumOperands() >= 3 &&
          isRegOperand(MI.getOperand(0))) {
        Register QuotReg = MI.getOperand(0).getReg();
        Register RemReg = getDivRemainderReg(QuotReg);
        if (RemReg && Live.contains(RemReg)) {
          std::optional<Register> AltQuotReg =
              findAvailableDivQuotReg(Live, MRI);
          if (AltQuotReg) {
            MI.getOperand(0).setReg(*AltQuotReg);
            MI.clearKillInfo();
            InsertedCopy =
                BuildMI(MBB, std::next(MI.getIterator()), MI.getDebugLoc(),
                        TII.get(AVR32::MOVrr), QuotReg)
                    .addReg(*AltQuotReg);
          } else {
            BuildMI(MBB, MI, MI.getDebugLoc(), TII.get(AVR32::ST_W_PreDec))
                .addReg(AVR32::SP)
                .addReg(RemReg);
            InsertedReload =
                BuildMI(MBB, std::next(MI.getIterator()), MI.getDebugLoc(),
                        TII.get(AVR32::LD_W_PostInc), RemReg)
                    .addReg(AVR32::SP, RegState::Define)
                    .addReg(AVR32::SP);
          }
          Changed = true;
        }
      }

      if (InsertedCopy)
        Live.stepBackward(*InsertedCopy);
      if (InsertedReload)
        Live.stepBackward(*InsertedReload);
      Live.stepBackward(MI);
    }
  }

  return Changed;
}

bool AVR32Peephole::runOnMachineFunction(MachineFunction &MF) {
  const AVR32Subtarget &STI = MF.getSubtarget<AVR32Subtarget>();
  const TargetInstrInfo &TII = *STI.getInstrInfo();
  const TargetRegisterInfo &TRI = *STI.getRegisterInfo();
  bool Changed = false;

