cozycactus/llvm-project/llvm/lib/Target/AVR32/AVR32Peephole.cpp
  bool LocalChanged;
  do {
    LocalChanged = false;
    for (MachineBasicBlock &MBB : MF) {
      for (MachineBasicBlock::iterator I = MBB.begin(), E = MBB.end(); I != E;) {
        MachineInstr &MI = *I++;
        switch (MI.getOpcode()) {
        case AVR32::ADDCrrr:
        case AVR32::ADDALrrr:
          LocalChanged |= foldTwoAddressALU(MI, AVR32::ADDrrCG, true, TII);
          break;
        case AVR32::ANDALrrr:
          LocalChanged |= foldTwoAddressALU(MI, AVR32::ANDrrCG, true, TII);
          break;
        case AVR32::ANDrr:
          LocalChanged |= foldBitImmediate(MI, TII);
          break;
        case AVR32::ANDLri:
        case AVR32::ANDHri:
        case AVR32::ANDLcg:
        case AVR32::ANDHcg:
          LocalChanged |= foldBitImmediate(MI, TII);
          break;
        case AVR32::EORALrrr:
          LocalChanged |= foldTwoAddressALU(MI, AVR32::EORrrCG, true, TII);
          break;
        case AVR32::MULrrr:
          LocalChanged |= foldTwoAddressALU(MI, AVR32::MULrrCG, true, TII);
          break;
        case AVR32::MOVri21:
          LocalChanged |= foldSignedImmediate(MI, AVR32::MOVri8, 8, true, TII);
          break;
        case AVR32::MOVEQriCG:
        case AVR32::MOVLTriCG:
        case AVR32::SREQr:
        case AVR32::SRLTr:
          LocalChanged |= foldDoubleCompareLibcall(MI, TII);
          break;
        case AVR32::CPri21:
          LocalChanged |= foldNarrowCompare(MI, TII, TRI) ||
                          foldSignedImmediate(MI, AVR32::CPri6, 6, false,
                                              TII);
          break;
        case AVR32::CPrr:
          LocalChanged |= foldNarrowCompare(MI, TII, TRI) ||
                          foldCompareImmediate(MI, TII);
          break;
        case AVR32::ORALrrr:
          LocalChanged |= foldRotate16(MI, TII) || foldMovhOr(MI, TII) ||
                          foldTwoAddressALU(MI, AVR32::ORrrCG, true, TII);
          break;
        case AVR32::ORrr:
          LocalChanged |= foldMovhOr(MI, TII) || foldBitImmediate(MI, TII);
          break;
        case AVR32::ORrrCG:
          LocalChanged |= foldRotate16(MI, TII);
          break;
        case AVR32::ORLri:
        case AVR32::ORHri:
        case AVR32::ORLcg:
        case AVR32::ORHcg:
          LocalChanged |= foldBitImmediate(MI, TII);
          break;
        case AVR32::CP_Wri21:
          LocalChanged |= foldNarrowCompare(MI, TII, TRI) ||
                          foldSignedImmediate(MI, AVR32::CP_Wri6, 6, false,
                                              TII);
          break;
        case AVR32::CP_Wrr:
          LocalChanged |= foldNarrowCompare(MI, TII, TRI) ||
                          foldCompareImmediate(MI, TII);
          break;
        case AVR32::CPri6:
        case AVR32::CP_Wri6:
          LocalChanged |= foldNarrowCompare(MI, TII, TRI);
          break;
        case AVR32::CASTS_Bcg:
        case AVR32::CASTS_Hcg:
        case AVR32::CASTU_Bcg:
        case AVR32::CASTU_Hcg:
          LocalChanged |= foldRedundantCastBeforeCompare(MI, TRI);
          break;
        case AVR32::LD_SH_Disp16:
          LocalChanged |= foldLoadDisp(MI, AVR32::LD_SH_Disp3, 14, 2, TII);
          break;
        case AVR32::LD_UB_Disp16:
          LocalChanged |= foldLoadDisp(MI, AVR32::LD_UB_Disp3, 7, 1, TII);
          break;
        case AVR32::LD_UH_Disp16:
          LocalChanged |= foldLoadDisp(MI, AVR32::LD_UH_Disp3, 14, 2, TII);
          break;
        case AVR32::LD_W_IndexShift:
          LocalChanged |= foldShiftedMaskIndexLoad(MI, TII, TRI);
          break;
        case AVR32::LD_W_Disp16:
          LocalChanged |= foldDoublewordLoad(MI, TII) ||
                          foldSPLoadDisp(MI, TII) ||
                          foldLoadDisp(MI, AVR32::LD_W_Disp5, 124, 4, TII);
          break;
        case AVR32::ST_B_Disp16:
          LocalChanged |= foldStoreDisp(MI, AVR32::ST_B_Disp3, 7, 1, TII);
          break;
        case AVR32::ST_H_Disp16:
          LocalChanged |= foldStoreDisp(MI, AVR32::ST_H_Disp3, 14, 2, TII);
          break;
        case AVR32::ST_W_Disp16:
          LocalChanged |= foldDoublewordStore(MI, TII) ||
                          foldSPStoreDisp(MI, TII) ||
                          foldStoreDisp(MI, AVR32::ST_W_Disp4, 60, 4, TII);
          break;
        case AVR32::SUBCrrr:
        case AVR32::SUBALrrr:
          LocalChanged |= foldTwoAddressALU(MI, AVR32::SUBrrCG, false, TII);
          break;
        default:
          break;
        }
      }
    }
    Changed |= LocalChanged;
  } while (LocalChanged);

  if (repairCompareBranchFlagClobbers(MF, TRI))
    Changed = true;

  if (repairDivRemainderClobbers(MF, TII, TRI))
    Changed = true;

  while (foldNearBranches(MF, TII))
    Changed = true;

  return Changed;
}

FunctionPass *llvm::createAVR32PeepholePass() { return new AVR32Peephole(); }
